app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "aa"], ["password", "11"], ["created_at", "2022-01-17 11:31:40.286215"], ["updated_at", "2022-01-17 11:31:40.286215"]]
---
    def create
        @user = User.new
        @user.username = params.require(:user)['username']
        @user.password = params.require(:user)['password']
        if @user.save