app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.find(session[:user_id]) if session[:user_id].present?